Revit 2026 API

# DocumentValidation Methods

---

The DocumentValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanDeleteElement | Indicates if an element can be deleted. |

#### Reference

DocumentValidation Class

Autodesk.Revit.DB Namespace